add sync job solution compare
